# Задача 30

# a1 = 7
# d = 2
# n = 5
# for i in range(n):
#     print(a1 + i * d, end=' ')


# Задача 32
# max = int(input("Введите максимальное число массива: ")) min = int(input("Введите минимальное число массива: ")) array_1 = [-5, 9, 0, 30, -1, -2, 1, 4, -2, 10, 2, 0, -9, 80, 10, -9, 0, -5, -5, 7]

# для i в диапазоне (len(array_1)): если min <= array_1[i] <= max: вывести(i)